کتاب نانو الکترونیک نوشته‌ی افشین رشید، به شرح این بخش از علم پرکاربرد الکترونیک می‌پردازد. طراحی، ساخت، توسعه و استفاده از ریز محصولاتی الکترونیکی که اندازه آن‌ها در بازه نانومتر قرار دارند را نانو الکترونیک گویند.

در بخشی از کتاب نانو الکترونیک می‌خوانیم:

در علوم الکترونیک مبحث نانو حول محور (حافظه‌های نانو؛ نانو چیپ‌ها و تراشه‌های سریع نانو و قطعات الکترونیکی نانو) با وزن کمتر و کارایی بیشتر می‌گردد. نانوتکنولوژی، دانش، مهندسی و فناوری در مقیاس نانو و یا به عبارت دیگر و مطالعه کاربرد اشیاء، بسیار ریز و استفاده از آن‌ها در تمام حوزه‌های علوم نظیر شیمی زیست شناسی، الکترونیک؛ علوم مواد و مهندسی است نانوتکنولوژی، توسعه مفاهیم و کارهای تجربی انجام گرفته در زمینه نانوتکنولوژی را شرح می‌دهد. 

